# Lecture 05 -- DDL, DML & Constraints

In [ ]:
# Run this cell to set up imports
import numpy as np
import pandas as pd

In [ ]:
%reload_ext sql

In [ ]:
!createdb lecture5 -h localhost

In [3]:
%sql postgresql://127.0.0.1:5432/lecture5

# manager demo

Creating the manager relation

In [ ]:
%sql DROP TABLE IF EXISTS managers;

In [ ]:
%%sql
CREATE TABLE managers (
    manager_name VARCHAR(20),
    age INTEGER DEFAULT 50,
    manager_id CHAR(4),
    PRIMARY KEY (manager_id),
    UNIQUE (manager_name)
);


/***********/
SELECT * FROM managers;

<br/><br/><br/>

Add a tuple (success)

In [ ]:
%%sql
INSERT INTO managers
    (age, manager_id)
VALUES
    (23, 'Lisa'),
    (23, 'Michael')
;

/***********/
SELECT * FROM managers;

<br/><br/><br/>

Add a tuple (failure)

In [ ]:
%%sql
INSERT INTO managers
    (manager_name, age)
VALUES
    ('Rich', 123);

/***********/
SELECT * FROM managers;

<br/><br/><br/>

Change schema: add attributes

In [ ]:
%%sql
ALTER TABLE managers
    DROP address,
    DROP income,
    ADD address VARCHAR (20),
    ADD income REAL DEFAULT 1000000.0;

/***********/
SELECT * FROM managers;

What if we want to add a timestamp?

In [ ]:
%%sql
ALTER TABLE managers
    ADD created_at timestamptz,
    ADD started_at timstamptz;

### Notes About Times And Timestamps:

* A `timestamp` is a date + time
* A time _without a timestamp_ **does not mean anything** without a bunch of context in many cases...
* _Always_ (almost) use `timestamptz` over `timestamp`
* There is also `time with timezone` and `time [without timezone]` type, but don't use the later...

In [ ]:
%%sql
INSERT INTO manager(created_at, started_at)
VALUES
    ('2024-08-20T09:30:00Z-0700', now())
;

In [ ]:
%sql SELECT * FROM managers;

<br/><br/><br/>

Change schema: drop attributes

In [ ]:
%%sql
ALTER TABLE manager
DROP address,
DROP income;

/***********/
SELECT * FROM manager;

<br/><br/><br/>

Delete the relation entirely

In [ ]:
%%sql
DROP TABLE managers;

In [ ]:
%sql
/***********/
SELECT * FROM managers;

In [ ]:
%%sql
DROP TABLE IF EXISTS Stops;
CREATE TABLE Stops(
  stop_id INTEGER,
  person_id INTEGER,
  -- This is not great...we should have a timezone, but the original data did not.
  stop_time TIMESTAMP,
  race VARCHAR(10),
  location VARCHAR(20) NOT NULL,
  age INTEGER,
  arrest BOOLEAN DEFAULT False,
  PRIMARY KEY (stop_id),
  UNIQUE (person_id, stop_time)
  );

In [ ]:
%sql SELECT * FROM Stops;

In [ ]:
%%sql
INSERT INTO Stops
    (stop_id, person_id, stop_time, location, arrest)
VALUES
    -- (0543, 1234, '2023-09-12 13:43:00', 'Oakland')
    (9999, 8888, '2023-09-12 13:43:00', 'Oakland', NULL)
;
SELECT * FROM Stops;

## IMDB Datebase

In [ ]:
%reload_ext sql

In [ ]:
%sql postgresql://127.0.0.1:5432/lecture5

In [ ]:
%%sql
DROP TABLE IF EXISTS actors CASCADE;
DROP TABLE IF EXISTS movies CASCADE;
DROP TABLE IF EXISTS cast_info;

CREATE TABLE sctors (
  id INTEGER,
  name TEXT,
  PRIMARY KEY(id)
);

CREATE TABLE movies (
  id INTEGER,
  title TEXT,
  PRIMARY KEY(id)
);

CREATE TABLE cast_info (
  person_id INTEGER,
  movie_id INTEGER,
  FOREIGN KEY (person_id)
    REFERENCES actors (id)
    ON DELETE SET NULL
    ON UPDATE CASCADE,
  FOREIGN KEY (movie_id)
    REFERENCES movies (id)
    ON DELETE SET NULL);

INSERT INTO actors VALUES
    (1, 'Tom Hanks'),
    (3, 'Michelle Yeoh')
;

INSERT INTO movies VALUES
    (23, 'Forrest Gump'),
    (45, 'Tomorrow Never Dies')
;

INSERT INTO cast_info VALUES
    (1, 23),
    (3, 45)
;

In [ ]:
%%sql
SELECT * FROM cast_info;

A. What if weâ€¦ Delete a tuple from Actor corresponding to id = 1?

In [ ]:
%%sql
DELETE FROM actors
WHERE id = 1;

In [ ]:
%%sql
SELECT * FROM cast_info;

(note: reset table layout for each choice)

B. Change a tuple in Actor from id = 1 to id = 2?

In [ ]:
%%sql
UPDATE actors
SET id = 2
WHERE id = 1;

In [ ]:
%%sql
SELECT * FROM actors;

In [ ]:
%%sql
SELECT * FROM cast_info;

C. Delete a tuple from Movie corresponding to id = 23?

In [ ]:
%%sql
DELETE FROM movies
WHERE id = 23;

In [ ]:
%%sql
SELECT * FROM cast_info;

D. Change a tuple in Movie from id = 23 to id = 24?

In [ ]:
%%sql
UPDATE movies
SET id = 24
WHERE id = 23;

E. Insert a tuple into `cast_info` that adds a new person_id not found in Actor?

In [ ]:
%%sql
INSERT INTO cast_info VALUES
    (467, 23)
;